package com.developer.islamicapp.Activities;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;
import android.view.View;
import android.view.WindowManager;

import com.developer.islamicapp.Adapter.AdapterNamazact;
import com.developer.islamicapp.Adapter.AdapterParah_and_surah_Reader;
import com.developer.islamicapp.Model.data_model_arabicandurdu;
import com.developer.islamicapp.R;
import com.developer.islamicapp.utils.Typcastregular;

import java.util.ArrayList;

public class NamazActivit_details extends AppCompatActivity {
    String chk;
    RecyclerView recyclerView;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_namaz_activit_details);
        Typcastregular.Typcastregular(getApplicationContext(), "SERIF", "Jameel_Noori_Nastaleeq_Kasheeda.ttf");
        findViewById(R.id.back).setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                finish();
            }
        });
        getWindow().setFlags(WindowManager.LayoutParams.FLAG_FULLSCREEN, WindowManager.LayoutParams.FLAG_FULLSCREEN);
        try {
            chk = getIntent().getStringExtra("chk");
        } catch (Exception e) {

        }
        if (!chk.isEmpty()) {
            recyclerView = findViewById(R.id.rec);
            recyclerView.setLayoutManager(new LinearLayoutManager(getApplicationContext()));
            recyclerView.setNestedScrollingEnabled(false);
            recyclerView.setDrawingCacheEnabled(true);

            recyclerView.setAdapter(new AdapterNamazact(this,  loadData(chk)));

        }


    }

    private ArrayList<data_model_arabicandurdu> loadData(String chk) {
        ArrayList<data_model_arabicandurdu> data = new ArrayList<>();

        switch (chk) {


            case "Hajj":


                //seperate activity create

                data.add(new data_model_arabicandurdu("", "ye blank hoga",
                        "حج\n" +
                                "\n" +
                                "آٹھ ذی الحجہ سےحج کےارکان شروع ھوجاتےہیں، آٹھویں ذی الحجہ کا سورج طلوع ھونیکےبعد احرام کی حالت میں مکہ مکرمہ سےمنیکےلئےروانہ ھونا ہے۔ \n" +
                                "\n"
                                ));

                data.add(new data_model_arabicandurdu("","","حج کا احرام حدود حرم میں کسی بھی جگہ سےباندھا جا سکتا ہے، اپنی قیام گاہ پر بھی باندھ سکتےہیں۔نفل طواف کرکےسر ڈھانک کر دورکعت واجب الطواف پڑھیں۔ اسکےبعد سر کھول کےاحرام کی نیت اسطرح کریں۔"));


                data.add(new data_model_arabicandurdu("", "ye blank hoga",
                        "َللّٰھُمَّ اِنِّی اُرِیدُ الحَجَّ فَیَسِّرہُ لِی وَ تَقَبَّلہُ مِنِّی\n" +
                                "\n" +
                                "لَبیکَ اَللّٰھُمَّ لبّیک لبَّیک لا شَرِیکَ لَکَ لبَّّیک، اِنَّ الحَمدَ وَ النِّعمۃ لَکَ وَ المُلکَ، لا شَرِیکَ لَکَ"));

                data.add(new data_model_arabicandurdu("", "ye blank hoga",
                        "نیت کرکےاور تلبیہ پڑھ کےآپ محرم ہوگئےاور احرام کی وہ ساری پابندیاں آپ پر عائد ہوگئیں جو عمرہ کےاحرام کےوقت تھیں۔\n" +
                                "\n" +
                                "منی کےلئےروانگی :آٹھویں تاریخ کو آپ نےحج کا احرام باندھ لیا، اب آج ہی آپکو منی جانا ہی، منی میں کوئی خاص عمل آپ کونہیں کرناہے، بس ظہر، عصر، مغرب، عشاءاور ٩، ذی الحجہ کی فجر کی نماز منی میں اد ا کرنا ہے۔ \n"));

                data.add(new data_model_arabicandurdu("","","نویں ذی الحجہ کو عرفات کےلئےروانگی : نویں ذی الحجہ کی صبح سورج نکلنےکےبعدمنی سےعرفات جانا ہے، آج مغفرت کا دن ہے،آج یوم عرفہ ہے، مسئلہ کی رُو سےمیدان عرفات میں ٩، ذی الحجہ کی دو پہر سے٠١، ذی الحجہ کی صبح صادق تک کچھ دیر کا قیام حج کارکن اعظم ہے، جس کےبغیر حج ادا نہیں ہوتا۔\n" +
                        "\n"));


                data.add(new data_model_arabicandurdu("", "ye blank hoga",
                        "\n" +
                                "٩، ذی الحجہ کو فجر کی نماز کےبعد تکبیرات تشریق شروع ہو جاتی ہیں، منٰی اور عرفات دونوں جگہ فرض نمازوں کےبعد ایک بار بلندآواز سےتکبیر تشریق پڑھیں:\n"));

                data.add(new data_model_arabicandurdu("", "ye blank hoga",
                        "\n" +
                                "اَللّٰہُ اکبَر اَللّٰہُ اکبَر، لااِلٰہَ الاّ اللّٰہُ وَ اَللّٰہُ اکبَر، اَللّٰہُ اکبَر وَ لِلّٰہِ الحَمد۔\n"));

                data.add(new data_model_arabicandurdu("", "ye blank hoga",
                        "، ذی الحجہ کی فجرسے٠١، ذی الحجہ تک فرض نماز کےبعدپہلےتکبیر تشریق اور پھر تلبیہ پڑھیں، چونکہ تلبیہ دسویں تاریخ کی رمی کےساتھختم ہو جاتا ہےاس لئےباقی ایام میں (یعنی ٣١، ذی الحجہ کی عصر تک) صرف تکبیرتشریق پڑھیں۔\n" +
                                "\n"
                                ));
                data.add(new data_model_arabicandurdu("","","فی زماننا بہتر یہی ہےکہ اپنےاپنےخیمےمیں روزانہ کی طرح ظہر اور عصر کی نماز اپنےاپنےوقت میں پڑھی جائی۔ وقوفِ عرفات کا وقتزوالِ آفتاب سےشروع ہو جاتا ہے۔اس لئےظہر کی نماز سےفارغ ہو کر وقوف میں مصروف ہو جائیں۔ سایہ کےبجائےدھوپ میںوقوف کرنا بہتر ہے، ہاں اگر کسی ضرر یا بیماری کا اندیشہ ہو تو سایہ میں اور خیمہ میں بھی وقوف کیا جا سکتا ہے۔ ہوسکےتو قبلہ رُخکھڑے ہوکر پورا وقت یعنی مغرب تک وقوف کیجیئے۔ اگر پورا وقت کھڑے رہنا مشکل ہو تو جتنی دیر کھڑے رہنےکی طاقت ہو،کھڑے رہیے۔ ضرورت ہو تو وقوف کےوقت بیٹھنا بلکہ لیٹنا بھی جائز ہے۔"));

                data.add(new data_model_arabicandurdu("", "ye blank hoga",
                        "۔ \n" +
                                "\n" +
                                "عرفات سےمزدلفہ کےلئےروانگی اب لاکھوں انسانوں کی یہ بستی یہاں سےتین میل دور منتقل ہو جائیگی، لیجئےمزدلفہ پہونچ گئے۔\n"
                                ));
                data.add(new data_model_arabicandurdu("","","\n" +
                        "بتلایا گیا ہےکہ مزدلفہ میں رات ٹھہرنےوالےحجاج کےحق میں یہ رات شب قدر سےبھی افضل ہےاس لئے اس رات کی عظمتاور قدرو قیمت کو یاد رکھیئے۔ یہ رات جاگ کر گزاری جائے۔ عبادت، ذکر، استغفار، توبہ اور درود شریف میں مشغول رہیں، نفلپڑھیں۔ لیٹنا یا سونا منع نہیں ہے، فجر کی نماز صبح صادق ہو تےہی اندھیرےمیں پڑھیں۔تاکہ صبح صادق کےبعد تھوڑی دیرمزدلفہ میںوقوف واجب ہے،اس پر بھی عمل ہو جائیگا۔ مزدلفہ کےوقوف کا وقت صبح صادق کےبعد شروع ہوتا ہےاور سورج نکلنےتک رہتاہے، \n"));

                data.add(new data_model_arabicandurdu("", "ye blank hoga",
                        "\n" +
                                "الحمد للہ دسویں ذی الحجہ کےسارے کام انجام پا گئے۔ اب آپ مکمل طور پر احرام کی پاندیوں سےفارغ ہو گئے۔ عورت بھی ابحلال ہو گئی۔ فارغ ہو کر آپ پھر منی چلےجائیں۔ طواف زیار ت کےبعد دو رات اور دو دن منی میں قیام کرنا ہے۔\n" +
                                "\n"
                               ));

                data.add(new data_model_arabicandurdu("","", "گیارہ اور بارہ ، ذی الحجہ کو تینوں جمروں کی رمی کرنا ہےاور آج رمی کا وقت زوالِ آفتاب کےبعد ہے۔ اپنےخیمےیا مسجد خیف میںظہر کی نماز ادا کریں اور پھر رمی کےلئےنکل جائیں۔\n" +
                        "\n" +
                        "راستہ میں سب سےپہلےجمرہ اولی ”چھوٹا شیطان“ آئےگا۔ بالکل اسی طرح جس طرح کل جمرہ عقبہ کی رمی کی تھی، اس پر ساتکنکریاں ماریں اور ہر کنکر ی پر :\n"));

                data.add(new data_model_arabicandurdu("", "ye blank hoga",
                        "بِسمِ اللّٰہِ اَللّٰہُ اَکبَر´، رَغمَاً لِلشَّیطَانِ وَ رِضًی لِلرَّحمَانِ"));

data.add(new data_model_arabicandurdu("","", "رمی کےبعد دائیں جانب ہٹ کر قبلہ رخ کھڑےہو کر دعا کریں۔ توبہ، استغفار اور تسبیح و ذکر کےبعد درود شریف پڑھیں، اپنےلئےدعامانگیں، اپنےدوست و احباب کےلئےبھی دعا مانگیں۔ اس کےبعد آگےچلیں جمرہ وسطی ” درمیانی شیطان“ پر آئیں اور اسی طرحسات کنکریاں ماریں، جس طرھ ”جمرہ اولی“ پر ماری تھیں اور ذرا ہٹ کر قبلہ رخ ہو کر دعا مانگیں اور اتنی دیر ہی ٹھہریں جتنی دیر”جمرہ اولی“ پر ٹھہرےتھی۔ اس کےبعدجمرہ عقبی‘ ”بڑےشیطان“ پر آئیں۔ اسی طرح سات کنکریاں اس کو بھی ماریں، جس طرحپہلےماری تھیں، مگر اس جمرہ پر ٹھہرنےیا دعا مانگنےکا ثبوت نہیں ہے\n" +
        "\n"));

                data.add(new data_model_arabicandurdu("", "ye blank hoga",
                        "\n" +
                                "اب حج کےتمام ارکان ادا ہو چکےہیں، اور حج کی نعمتِ عظمی آپ کو حاصل ہو چکی ہے، صرف طوافِ وداع کرنا باقی ہے"));
                data.add(new data_model_arabicandurdu("", "ye blank hoga",
                        "طواف وداع : جب مکہ معظمہ سےوطن واپس ہونےکا ارادہ ہو تو طواف وداع یعنی رخصتی کا طواف کیا جاتا ہے، یہ طواف مکہسےباہر رہنےوالے”آفاقی“ پر واجب ہے۔\n" +
                                "\n" +
                                "جس عورت کو حیض آرہا ہو یا نفاس کی حالت میں ہو اورمکہ سےرخصت ہونےکےوقت تک پاک نہ ہو تو اس سےطوافِ وداعمعاف ہو جاتا ہے، ایسی عورت کو چاہیےکہ حرم شریف کےدروازہ سےباہر کھڑی ہو کر دعا مانگ لےاور حرم شریف میں داخل نہہو"));
                data.add(new data_model_arabicandurdu("", "ye blank hoga",
                        "\n" +
                                "بیت اللہ کی جدائی پر افسوس اور ندامت کا اظہار کیجئے، مسجد حرام سےالٹے پیر نکلنا آپ سےثابت نہیں ہے، تاہم علماءکرام اوربزرگانِ دین نےکعبۃ اللہ کی عظمت کےخاطر ایسا کرنا بہتر بتایا ہے۔\n" +
                                "\n"
                                ));
                data.add(new data_model_arabicandurdu("","","اس عرصہ میں مسجد حرام اور بیت اللہ کےآداب اور حقوق کےبارےمیں آپ سےجو کوتاہیاں ہوئیں اُن کی معافیمانگتےہوئےمسجد حرام سےنکلیےاور حسب قاعدہ بایاں پاؤں پہلےنکالییے(باب الوداع یا کسی بھی دروازےسے) مسجد حرام سےباہرنکلتےہوئےیہ دعا پڑھیے:\n" +
                        "\n" +
                        "اَللّٰھمَّ اغفِر´ لِی´ ذُنُوبِی وَ افتَح´ لِی اَبوَابَ رَحمَتِکَ\n"));


                return data;
            case "TW":

                data.add(new data_model_arabicandurdu("", "", "\n" +
                        "نماز دین اسلام کا ایک اہم رکن ہے جس کے بغیر بندہ مؤمن نہیں بن سکتا۔\n" +
                        "اور نبی کریمﷺ نے وضو کو نماز کی چابی قرار دیا ہے۔ [سنن أبي داؤد، کتاب الطہارۃ، باب فرض الوضوء"));
                data.add(new data_model_arabicandurdu("", "", "، (61)]\n" +
                        "یعنی وضو کے بغیر نماز نہیں ہوتی اور جس چابی کے دندانے ہی خراب ہوں، وہ چابی بھی کسی کام کی" +
                        " نہیں ہوتی، لہٰذا نماز کےلیے وضو بھی کیا جائے تو عین اس طریقہ کے مطابق، جس طریقہ سے وضو کرنے کا شریعت نے حکم دیا ہے۔ اگر "

                        ));

                data.add(new data_model_arabicandurdu("", "",  "وضو سنت نبوی کے مطابق ہوگا تو وہ وضو نماز کی ادائیگی کےلیے مؤثر ہوگا، وگرنہ ناقص وضو کی صورت میں اقامتِ صلاۃ ناممکن ہے۔"));


                data.add(new data_model_arabicandurdu("", "", "لہٰذا وضو کرنے میں انتہائی احتیاط کی ضرورت ہے کہ وضو مکمل، صحیح اور سنت مطہرہ کے مطابق ہو۔"));




                        data.add(new data_model_arabicandurdu("", "", "طریقہ وضو:\n" +
                        "\n" +
                        "نیت کرنا:\n" +
                        "\n" +
                        "رسول اللہﷺ کا فرمان ہے:\n" +
                        "«إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ» ’’یقیناً اعمال کا دار ومدار نیتوں پر ہے۔‘‘\n" +
                        "[صحیح البخاري، کتاب بدء الوحی، باب بدء الوحی،(1)]\n"));
                data.add(new data_model_arabicandurdu("", "", "\n" +
                        "بسم اللہ سے آغاز کرنا:\n" +
                        "نبی کریمﷺ کا فرمان ہے: «لَا وُضُوءَ لِمَنْ لَمْ يَذْكُرْ اسْمَ اللَّهِ عَلَيْهِ»\n" +
                        "’’جس شخص نے وضو اللہ کا نام لیے بغیر کرلیا، تو اس کا وضو نہیں ہے۔‘‘ [سنن الترمذي، أبواب الطہارۃ عن رسول اللہﷺ، باب ما جاء في التسمیۃ عند الوضوء"));

                data.add(new data_model_arabicandurdu("","", "وضو کے آغاز میں «بسم اللہ» یا «بسم اللہ الرحمن الرحیم» میں سے کوئی بھی پڑھ لیں،" +
                        " درست ہے۔ کیونکہ مقصود اللہ کا نام لینا ہے اور وہ دونوں صورتوں میں حاصل ہے"
                ));

                data.add(new data_model_arabicandurdu("","",
                        " نیز کلمہ طیبہ و درود لا الہ الا اللہ محمد رسول اللہ صلی اللہ علیہ وسلم پڑھنے کا بھی بہت اجر ہے۔\n" +
                                "دائیں جانب سے آغاز: سیدنا ابو ہریرہ رضی اللہ عنہ بیان فرماتے ہیں کہ رسول اللہﷺ نے فرمایا:\n"
                        ));
                data.add(new data_model_arabicandurdu("", "", "25)]\n" +
                         "«إِذَا تَوَضَّأْتُمْ، فَابْدَءُوا بِأَيَامِنِكُمْ» ’’جب تم وضو کرو تو دائیں جانب سے آغاز کرو۔‘‘ [سنن أبي داؤد، کتاب اللباس، باب في الانتعال، (4141)]\n"));
                data.add(new data_model_arabicandurdu("", "", "\n" +
                        "ہاتھ دھونا:\n" +
                        "رسول اللہﷺ نے فرمایا: «إِذَا اسْتَيْقَظَ أَحَدُكُمْ مِنْ نَوْمِهِ فَلْيَغْسِلْ يَدَهُ قَبْلَ أَنْ يُدْخِلَهَا فِي وَضُوئِهِ، فَإِنَّ أَحَدَكُمْ لاَ يَدْرِي أَيْنَ بَاتَتْ يَدُهُ»\n"
                        ));

                data.add(new data_model_arabicandurdu("","","’’جب تم میں سے کوئی اپنی نیند سے بیدار ہو تو اپنے ہاتھ کو وضو والے برتن میں" +
                        " ڈالنے سے پہلے دھو لے کیونکہ وہ نہیں جانتا کہ اس کے ہاتھ نے کہاں رات گزاری ہے۔‘‘" ));

                data.add(new data_model_arabicandurdu("", ""," [صحیح البخاري، کتاب الوضوء، باب الاستجمار وتراً، (162)]\n" +
                                "یعنی جب بندہ نیند سے بیدار ہو تو اپنے ہاتھوں کو برتن میں ڈالنے سے پہلے دھوئے۔ یہ دھونا لازمی وضروری ہے۔"));


                data.add(new data_model_arabicandurdu("", "", "\n" +
                        "سیدنا علی رضی اللہ عنہ نے وضو فرمایا تو پہلے اپنے ہاتھوں کو دھویا حتیٰ کہ انہیں صاف کیا، پھر کلی کی اور ناک میں پانی چڑھایا اور ناک کو جھاڑا اور آخر میں فرمایا: ’’میں تمہیں رسول اللہﷺ کا وضو دکھانا چاہتا تھا۔ ‘‘ [سنن الترمذي، أبواب الطھارۃ، باب ما جاء في وضوء النبي ﷺ کیف کان، (48)]\n" +
                        "\n" ));

                data.add(new data_model_arabicandurdu("","", "کلی کرنا، ناک میں پانی چڑھانا اور ناک جھاڑنا:\n" +
                        "نبی کریمﷺ نے حکم دیا ہے: «إِذَا تَوَضَّأْتَ فَمَضْمِضْ»"));

                data.add(new data_model_arabicandurdu("", "", "’’جب تو وضو کرے تو کلی کر۔‘‘ [سنن أبي داؤد، کتاب الطھارۃ، باب في الاستنثار، (144)]\n" +
                        "اسی طرح فرمایا: «إِذَا تَوَضَّأَ أَحَدُكُمْ فَلِيَجْعَلْ فِي أَنْفِهِ مَاءً ثُمَّ لِيَنْتَثِرْ» ’’جب تم میں سے کوئی ایک وضو کرے تو اپنے ناک میں پانی ڈالے، پھر اس کو جھاڑے۔‘‘ [صحیح مسلم، کتاب الطھارۃ، باب الإیتار في الاستنثار والاستجمار"));
                data.add(new data_model_arabicandurdu("", "", "یاد رہے کہ ایک ہی چلو میں پانی لے کر کچھ کلی کرنے کےلیے منہ میں ڈالنا ہے اور کچھ ناک" +
                        " میں داخل کرنا ہے۔ [صحیح مسلم، کتاب الطھارۃ، باب في وضوء النبيﷺ، (235)]\n" +
                        "پہلے تین بار کلی کرلینا، پھر علیحدہ پانی لے کر بعد میں تین بار ناک میں پانی چڑھانا رسول اللہﷺ سے ثابت نہیں۔"));



                data.add(new data_model_arabicandurdu("", "", "نیز جاننا چاہیے کہ «استنشاق» عربی زبان میں ناک کی ہوا کے ذریعہ پانی کھینچنے کو کہتے ہیں۔ تو یعنی محض ناک کے ساتھ پانی لگا دینے سے یا ہاتھ کے زور سے ناک میں کچھ پانی داخل کرلینے سے فریضہ ٔ استنشاق ادا نہیں ہوتا، بلکہ نبی کریمﷺ نے تو حکم دیا ہے: «بَالِغْ فِي الِاسْتِنْشَاقِ إِلَّا أَنْ تَكُونَ صَائِمًا»\n"
                        ));

                data.add(new data_model_arabicandurdu("","","’’ناک میں پانی چڑھانے میں مبالغہ کر، إلاّ کہ تو روزہ دار ہو۔‘‘ [سنن أبي داؤد، کتاب الطہارۃ، باب فی الاستنثار، (142)]\n" +
                        "تو غیر روزہ دار کےلیے لازمی ہے کہ وہ خوب اچھی طرح ناک میں پانی چڑھائے۔ اسی طرح ناک کو جھاڑنا بھی وضو کا حصہ ہے۔ بغیر ناک جھاڑے کیا گیا وضو مسنون نہ ہوگا۔"))
                ;
                data.add(new data_model_arabicandurdu("", "", "\n" +
                        "چہرہ دھونا:\n" +
                        "اللہ تعالیٰ کا فرمان ہے: ‹ يٰٓاَيُّھَا الَّذِيْنَ اٰمَنُوْٓا اِذَا قُمْتُمْ اِلَى الصَّلٰوۃِ فَاغْسِلُوْا وُجُوْہَكُمْ› ’’اے اہل ایمان! جب تم نماز کےلیے کھڑے ہونے لگو تو اپنے چہروں کو دھو لو۔‘‘ [المائدۃ: 6]\n" +
                        "\n" ));


                data.add(new data_model_arabicandurdu("","","داڑھی کا خلال:\n" +
                        "سیدنا انس بن مالک رضی اللہ عنہ فرماتے ہیں کہ جب رسول اللہﷺ وضو فرماتے تو ایک چلو میں پانی لے کر اپنی تھوڑی کے نیچے داخل کرتے اور اس کا خلال کرتے اور فرماتے: «هَكَذَا أَمَرَنِي رَبِّي عَزَّ وَجَلَّ» ’’مجھے میرے رب عزوجل نے اسی طرح حکم دیا ہے۔‘‘ [سنن أبي داؤد، کتاب الطہارۃ، باب تخلیل اللحیۃ، (145)]\n"));
                data.add(new data_model_arabicandurdu("", "", "\n" +
                        "کہنیوں سمیت دونوں ہاتھ دھونا:\n" +
                        "اللہ رب العزت کا حکم ہے:\n" +
                        "‹ وَاَيْدِيَكُمْ اِلَى الْمَرَافِقِ›\n" +
                        "’’اور اپنے ہاتھوں کو کہنیوں سمیت دھو لو۔‘‘ [المائدۃ: 6"));
                data.add(new data_model_arabicandurdu("", "", "\n" +
                        "انگلیوں کا خلال:\n" +
                        "نبی کریمﷺ نے حکم دیا ہے: «وَخَلِّلْ بَيْنَ الأَصَابِعِ»\n" +
                        "’’اور انگلیوں کا خلال کر۔‘‘\n"
                       ));


                data.add(new data_model_arabicandurdu("","", "[سنن الترمذي، أبواب الصوم، باب ما جاء في کراھیۃ مبالغۃ الاستنشاق للصائم، (788)]\n" +
                        "ہر دو انگلیوں کے درمیان دوسرے ہاتھ کی انگلی کو خوب اچھی طرح پھیریں تاکہ انگلیوں کے درمیان والی جگہ بھی تَر ہوجائے، خشک نہ رہے۔ اسی کا نام خلال کرنا ہے۔\n"));
                data.add(new data_model_arabicandurdu("", "", "\n" +
                        "سر کا مسح کرنا:\n" +
                        "اللہ تعالیٰ کا ارشاد ہے: ‹وَامْسَحُوْا بِرُءُوْسِكُمْ› ’’اور اپنے سروں کا مسح کر لو۔‘‘ [المائدۃ: 6]\n" +
                        "نبی کریمﷺ نے سر کا مسح فرمایا: «فَأَقْبَلَ بِهِمَا وَأَدْبَرَ، بَدَأَ بِمُقَدَّمِ رَأْسِهِ حَتَّى ذَهَبَ بِهِمَا إِلَى قَفَاهُ، ثُمَّ رَدَّهُمَا إِلَى المَكَانِ الَّذِي بَدَأَ مِنْهُ»\n"
                        ));


                data.add(new data_model_arabicandurdu("","","’’دونوں ہاتھوں کو آگے لے گئے اور پھر واپس لائے۔ سر کے آغاز سے شروع فرمایا حتیٰ کہ انہیں اپنی گدی تک لے گئے، پھر ان کو اسی جگہ پر واپس لے آئے جہاں سے آغاز کیا تھا۔‘‘ [صحیح البخاري، کتاب الوضوء، باب مسح الرأس کلہ، (185)]\n" +
                        "یعنی آغازِ سر سے انتہائے سر تک دونوں ہاتھوں کو لے کر گئے، پھر انہیں واپس لائے۔ یہاں یہ بات بھی ملحوظ رہے کہ کچھ لوگ سر کے مسح کے دوران سر کے اطراف سے ہاتھوں کو اٹھا لیتے ہیں جبکہ سر کے اطراف (کانوں والی جانبیں) بھی سر کے اندر داخل ہیں"));
                data.add(new data_model_arabicandurdu("", "", "\n" +
                        "کانوں کا مسح:\n" +
                        "رسول اللہﷺ کا فرمان ہے: «اَلْأُذُنَانِ مِنَ الرَّأْسِ» ’’دونوں کان سر میں سے ہیں۔‘‘ [سنن الترمذي، أبواب الطھارۃ، باب ما جاء أن الأذنین من الرأس، (37)]\n" ));


                data.add(new data_model_arabicandurdu("","", "یعنی دونوں کان سر کا حکم رکھتے ہیں تو جب سر کے مسح کا اللہ تعالیٰ نے حکم دیا ہے تو کان بھی اسی حکم کے تحت داخل ہوگئے۔ یعنی کا نوں کا بھی مسح کیا جائے۔\n" +
                        "اور رسول اللہﷺ نے کا نوں کا مسح فرمایا: «بَاطِنِهِمَا بِالسَّبَّاحَتَيْنِ وَظَاهِرِهِمَا بَإِبْهَامَيْهِ»\n"));
                data.add(new data_model_arabicandurdu("", "", "’’کان کے سوراخ والے حصہ کا مسح شہادت والی انگلی سے کیا اور سر والی جانب کا مسح اپنے انگوٹھے کے ساتھ فرمایا۔‘‘ [سنن النسائي، کتاب الطھارۃ، باب مسح الأذنین مع الرأس وما یستدل بہ علی أنھما من الرأس، (102)]\n" +
                        "عموماً کانوں کا مسح کرنے میں کوتاہی برتی جاتی ہے، غفلت بھرے انداز میں کانوں کا مسح تیزی کے ساتھ کیا جاتا ہے، جس کے نتیجہ میں کانوں کا کچھ حصہ مسح کی زد میں نہیں آتا، جبکہ مکمل کانوں کا مسح کرنا ضروری ہے تو اس کے لیے بہتر طریقہ یہ ہے کہ کان کی لَو سے مسح کا آغاز اس طرح کریں کہ انگوٹھے اور شہادت والی انگلیوں سے دونوں کانوں کو پکڑے اور پھر پہلے اپنی انگلیوں کو راستوں سے گھماتے گھماتے کانوں کے سوراخ تک لے جائیں، پھر انگلیوں کو کانوں سے باہر نکالے بغیر اپنے انگوٹھوں کو پیچھے سے گھما دیا جائے۔ اسی طرح تسلی سے مکمل کان کا مسح ہوجائے گا"));
                data.add(new data_model_arabicandurdu("", "", "\n" +
                        "پاؤں دھونا:\n" +
                        "اللہ رب العالمین کا ارشاد ہے: ‹وَاَرْجُلَكُمْ اِلَى الْكَعْبَيْنِ› ’’اور اپنے پاؤں کو ٹخنوں سمیت دھو لو۔‘‘ [المائدۃ: 6] لہٰذا کانوں کا مسح کرنے کے بعد پہلے دایاں اور پھر بایاں پاؤں بالترتیب دھویا جائے اور ہر پاؤں دھونے کے ساتھ ساتھ اس کی انگلیوں کا خلال بھی کیا جائے کہ رسول اللہﷺ کا فرمان ہے: «إِذَا تَوَضَّأْتَ فَخَلِّلْ بَيْنَ أَصَابِعِ يَدَيْكَ وَرِجْلَيْكَ»\n" +
                        "’’جب تو وضو کرے تو اپنے ہاتھوں اور پاؤں کی انگلیوں کے درمیان خلال کرلے۔‘‘ [سنن الترمذي، أبواب الطھارۃ، باب ما جاء في تخلیل الأصابع، (39)]\n"));
                data.add(new data_model_arabicandurdu("", "", "\n" +
                        "وضو کر نے کے بعد کی دعا:\n" +
                        "وضوکرلینے کے بعد یہ دعا پڑھیں: «أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللہُ وَحْدَهُ لَا شَرِيكَ لَهُ، وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ» [صحیح مسلم، کتاب الطہارۃ، باب الذکر المستحب عقب الوضوء"));


                return data;
            case "TG":
                data.add(new data_model_arabicandurdu(
                        "", "ye blank hoga", "غسل کی اقسام\n" +
                        "\n" +
                        "غسل کی تین قسمیں ہیں:\n" +
                        "(۱) فرض (۲) مسنون (۳) مستحب\n" +
                        "غسل کب فرض ہوتا ہے؟\n" +
                        "چار چیزوں میں سے کسی ایک چیز کی وجہ سے غسل فرض ہوتا ہے۔\n"
                ));


                data.add(new data_model_arabicandurdu("", "", "چار چیزوں میں سے کسی ایک چیز کی وجہ سے غسل فرض ہوتا ہے۔\n" +
                        "(۱) جنبی انسان پر غسل فرض ہوتا ہے۔\n" +
                        "(۲) عورت پر جب حیض سے پاک ہو تو غسل فرض ہوتا ہے۔\n" ));

                data.add(new data_model_arabicandurdu("","","(۳) عورت پر جب نفاس سے پاک ہو تو غسل فرض ہوتا ہے۔\n" +
                        "(۴) زندوں پر مردہ کو غسل دینا فرض ہوتا ہے۔\n"));

                data.add(new data_model_arabicandurdu(
                        "", "ye blank hoga", "غسل کب مسنون ہوتا ہے؟\n" +
                        "چار چیزوں کی وجہ سے غسل مسنون ہوتا ہے۔\n" +
                        "(۱) جمعہ کی نماز کے لئے ۔\n"));

                data.add(new data_model_arabicandurdu("", "", "(۲) عیدین کی نماز کے لئے ۔\n" +
                        "(۳) احرام کے لئے ۔\n" +
                        "(۴) حاجیوں کے لئے عرفہ میں سورج ڈھلنے کے\n"));


                data.add(new data_model_arabicandurdu(
                        "", "ye blank hoga", "غسل کب مستحب ہوتا ہے؟\n" +
                        "مندرجہ ذیل صورتوں میں غسل مستحب ہوتا ہے۔\n" +
                        "شعبان کی پندرھویں رات میں۔\n"
                ));

                data.add(new data_model_arabicandurdu("", "", "شب قدر میں۔\n" +
                        "سورج گہن کی نماز کے لئے اور چاند گہن کی نماز کے لئے ، بارش طلب کرنے کے لئے پڑھی جانے والی نماز کے لئے۔\n" +
                        "گھبراہٹ کے وقت، تاریکی کے وقت ، سخت آندھی کے وقت ۔\n" +
                        "نئے کپڑے پہنتے وقت۔\n"));


                data.add(new data_model_arabicandurdu(
                        "", "ye blank hoga", "گناہوں سے توبہ کرنے والوں کے لئے۔\n" +
                        "سفر سے آنے والے کے لئے ۔\n"
                ));

                data.add(new data_model_arabicandurdu("", "", "مدینہ منورہ میں داخل ہونے والے کے لئے۔\n" +
                        "مکہ مکرمہ میں داخل ہونے کا ارادہ کرنے والے کے لئے۔\n" +
                        "قربانی کے دن صبح مزدلفہ میں ٹہرتے وقت ، طواف زیارت کے لئے۔"));


                data.add(new data_model_arabicandurdu(
                        "", "ye blank hoga", "میت کو غسل دینے والے کے لئے ۔\n" +
                        "پچھنا لگوانے کے بعد۔\n"
                ));


                data.add(new data_model_arabicandurdu("", "", "جنون سے افاقہ ہو جانے والے کے لئے ،اسی طرح بیہوشی اور نشہ سے افاقہ ہو جانے والے کے لئے غسل کرنا مستحب ہے۔\n" +
                        "پاک ہونے کی حالت میں مسلمان ہونے والے کے لئے ، ہاں! اگر مسلمان ہونے والا جنبی ہو تو اس پر غسل فرض ہے۔\n"));

                data.add(new data_model_arabicandurdu(
                        "", "ye blank hoga", "غسل کا طریقہ\n" +
                        "\n" +
                        "غسل میں تین چیزیں فرض ہیں۔\n"
                ));
                data.add(new data_model_arabicandurdu("", "", "(۱) کلی کرنا۔\n" +
                        "(۲) ناک میں پانی ڈالنا۔\n" +
                        "(۳) پورے بدن میں اس طرح پانی پہنچائے کہ بدن میں کوئی جگہ خشک نہ رہ جائے\n" +
                        "مندرجہ ذیل چیزیں غسل میں مسنون ہیں، غسل کرنے والے کے لئے ان چیزوں کی رعایت کرنا بہتر ہے تاکہ غسل مکمل طریقے سے ہوسکے"));


                data.add(new data_model_arabicandurdu(
                        "", "ye blank hoga", "(۱) غسل شروع کرنے سے پہلے بسم اللہ الرحمن الرحیم کہنا۔ \n" +
                        "(۲) طہارت حاصل کرنے کی نیت سے غسل کرنا۔ \n" +
                        "(۳) دونوں ہاتھوں کو پہلے گٹوں تک دھونا، جس طرح وضو میں کرتے ہیں۔\n"
                ));

                data.add(new data_model_arabicandurdu("", "", "(۴) اگر بدن یا کپڑے پر نجاست ہو تو غسل کرنے سے پہلے نجاست کا دھونا۔\n" +
                        "(۵) غسل کرنے سے پہلے وضو کرنا۔ \n" +
                        "لیکن اگر ایسی پست جگہ میں کھڑا ہو جہاں پانی اکٹھا ہوتا ہے تو پیروں کے دھونے کو مؤخر کرنا۔ \n"));


                data.add(new data_model_arabicandurdu(
                        "", "ye blank hoga", "(۶) تین مرتبہ پورے بدن پر پانی ڈالنا۔ \n" +
                        "(۷)پہلے سرپرپانی ڈالنا، پھر داہنے کندھے پر پھر بائیں کندھے پر۔ \n"
                      ));
                data.add(new data_model_arabicandurdu("","",  "(۸) اپنے جسم کورگڑنا۔\n" +
                        "(۹) اپنے بدن کو اس طرح مسلسل دھونا کہ دوسرے عضو کے دھونے سے پہلے پہلا عضو خشک نہ ہو جائے\n" +
                        "غسل کا مکمل طریقہ کار درج ذیل ہے"));


                data.add(new data_model_arabicandurdu(
                        "", "ye blank hoga", "1- جنابت، حیض یا نفاس سے پاکی حاصل کرنے کی نیت دل سے کرے ۔\n" +
                        "2- بسم اللہ پڑھے، اپنے ہاتھوں کو تین بار دھوئے اور اپنی شرمگاہ کو بھی غلاظت سے صاف کرے۔\n"
                        ));
                data.add(new data_model_arabicandurdu("","","3- نماز کی طرح مکمل وضو کرے۔\n" +
                        "4- اپنے سر پر تین مرتبہ  پانی بہائے اور بالوں کو ملے حتی کہ پانی بالوں کی جڑوں تک پہنچ جائے۔\n" +
                        "5- اپنے پورے بدن پر پانی بہائے اس کیلیے پہلے اپنے جسم کی دائیں جانب پانی ڈالے، پھر بائیں جانب، اور اس دوران اپنے دونوں ہاتھوں سے جسم کو ملے تا کہ ہر جگہ تک پانی پہنچ جائے۔\n"));


                return data;

            case "NE":
                data.add(new data_model_arabicandurdu("", "", "نماز عیدین (عربی: صلاة العید) دو اسلامی تہواروں (عیدین) کے موقع پر ادا کی جانے والی خصوصی نماز ہے۔"));
                data.add(new data_model_arabicandurdu("", "", "\n" +
                        "عید الفطر کی نماز یکم شوال کو ادا کی جاتی ہے۔"));
                data.add(new data_model_arabicandurdu("", "", "عیدالاضحی کی نماز دس ذوالحجہ کو ادا کی جاتی ہے۔\n"));
                data.add(new data_model_arabicandurdu("", "", "\n" +
                        "دونوں مواقع پر یہ خصوصی نمازیں عام طور پر عید گاہ میں ادا کی جاتی ہیں۔. \n" +
                        "عیدالفطر اور عیدالاضحی کی نمازیں ہر اس شخص پر واجب ہیں جس پر جمعہ فرض ہے۔ عیدین دوگانہ یعنی دو رکعتوں والی نماز ہے۔ نمازِ عیدین کا طریقہ وہی ہے جو دیگر نمازوں کا ہے۔ نماز عیدین کا وقت آفتاب کے بلند ہوجانے کے بعد زوال سے پہلے تک ہے۔"));
                data.add(new data_model_arabicandurdu("", "", "  فرق صرف اتنا ہے کہ نماز عیدین میں چھ زائد تکبیریں کہی جاتی ہیں۔ امام تکبیر تحریمہ کے بعد ثنا پڑھے، پھر ہاتھ اُٹھا کر تین تکبیریں کہے"));
                data.add(new data_model_arabicandurdu("", "", "،، تیسری تکبیر کے بعد ناف کے نیچے ہاتھ باندھ لے، مقتدی بھی ایسا ہی کریں۔ پھر امام تعوذ و تسمیہ کے بعد جہراً قرات کرے۔ قرات کے بعد حسبِ معمول رکوع و سجود کیے جائیں۔ پھر دوسری رکعت شروع ہوگی۔ امام قرات کرے، قرات کے بعد تین مرتبہ ہاتھ اُٹھا کر تکبیریں کہے، مقتدی بھی امام کے ساتھ ایسا ہی کریں اور چوتھی مرتبہ امام ہاتھ اُٹھائے بغیر تکبیر رکوع کرے، مقتدی بھی ایسا ہی کریں، اس طرح دو رکعت نماز مکمل کی جائے گی"));


                return data;
            case "NJ":

                data.add(new data_model_arabicandurdu("", "ye blank hoga", "نماز جنازہ کا طریقہ"));
                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\n" +
                        "میت کو صفوں کے آگے وست میں رکھا جائے اور امام میت کے سینے کے مقابل قبلہ رخ کھڑا ہو اور لوگ پیچھے صفیں بنائیں جیسا کہ تفصیل آگے آتی ہے امام ! اور قوم نمازِ جنازہ کی نیت اس طرح کریں کہ\n" +
                        "\"میں نمازِ جنازہ پڑھنے کی نیت کرتا ہوں اور خانہ کعبہ کی طرف متوجہ ہوں نماز اللّٰہ کے لئے ہے اور دعا میت کے لئے"));
                data.add(new data_model_arabicandurdu("", "ye blank hoga", "مقتدی امام کی اقتدا کی نیت بھی کرے پھر دونوں ہاتھ کانوں کی لو تک اٹھا کر امام بلند آواز سے تکبیر ( اللّٰہ اکبر) کہے اور مقتدی آہستہ آواز سے کہیں اور امام و مقتدی سب عام نمازوں کی طرح ناف کے نیچے ہاتھ باندھ لیں اور دوسری نمازوں کی طرح ثنا (سبحاک اللھم) آہستہ پڑھیں لیکن اس ثنا میں! وتعالٰی جدک کے بعد و جلّ ثنائُ ک زیادہ کرنا بہتر ہے پھر بغیر ہاتھ اٹھائے امام بلند آواز سے اس کے بعد مقتدی آہستہ اللّٰہ اکبر کہیں اور درود شریف پڑھیں بہتر وہی درود شریف ہے جو دوسری نمازوں میں آخری قعدہ میں پڑھتے ہیں پھر تیسری تکبیر اسی طرح بلا ہاتھ اٹھائے امام بلند آواز سے اور مقتدی آہستہ کہیں اور اپنی اور میت اور تمام مومنین اور مومنات کے لئے دعا کریں جو دعائیں احادیث میں آئیں ہیں ان میں سے پڑھنا بہتر ہے مشہور دعا جو عام طور پر پڑھی جاتی ہے یہ ہے\n"
                        ));
                data.add(new data_model_arabicandurdu("","","\" اَللّٰھُمَّ اغفِر لِحَیِّنَا وَ مَیِّتِنَا وَ شَاھِدِ نَا وَ غَائِبِنَا وَ صَغِیرِنَا وَ کَبِیرِنَا وَذَکَرِنَا وَ اُنثَانَا اللّٰھُمَّ مَن اَحیَیطَہُ مِنَّا فَاحیِہِ عَلَی الاِسلَامِ وَمَن تَوَفَّیتَہُ مِنَا فَتَوفَّہُ عَلَی الاِیمَانِ ط\"\n" +
                        "اگر یہ دعا یاد نہ ہو تو جو دعا یاد ہو وہی پڑھ لے لیکن وہ دعا اور آخرت سے متعلق ہو اگر کوئی یاد نہ ہو تو یہ پڑھ لینا کافی ہے\n"));
                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\"اللّٰھُمَّ اغفِر لِلمُومِنِینَ وَالمُومِنَاتِ\"\n" +
                        "اگر میت ایسے مجنون مرد کی ہو جو بالغ ہونے سے پہلے مجنون ہوا ہو یا نابالغ لڑکے کی ہو تو مذکورہ بالا دعا کے بجائے یہ دعا پڑھیں\n" +
                        "\" اللّٰھُمَّ اجعَلہُ لَنَا فَرَطًا وَّ اجعَلہُ لَنَا اَجراً وَّ ذُخراً وَّ اجعَلہُ لَنَا شَافِعا وَّ مُشَفَّعاً \"\n"));
                data.add(new data_model_arabicandurdu("", "ye blank hoga", "اگر میت ایسی مجنون عورت یا نابالغ لڑکی کی ہو تو یہی دعا مونث کا صیغہ بدل کر یوں پڑھیں\n" +
                        "\" اللّٰھُمَّ اجعَلہُ لَنَا فَرَطًا وَّ اجعَلھَا لَنَا اَجراً وَّ ذُخراً وَّ اجعَلھَا لَنَا شَافِعتً وَّ مُشَفَّعت"));
                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\n" +
                        "دعا کے بعد ہاتھ اٹھائے بغیر چوتھی تکبیر امام بلند آواز سے اور مقتدی آہستہ کہیں اس کے بعد اور کوئی دعا نہ پڑھیں بلکہ سلام پھیر دیں جیسا کہ اور نمازوں میں پھیرتے ہیں اور دوسرے سلام کے بعد ہاتھ چھوڑ دیں دائیں طرف کے سلام میں دائیں طرف کے حاضرین اور فرشتوں کی نیت کرے اور بائیں طرف کے سلام میں بائیں طرف کے حاضرین اور فرشتوں کی اور امام و میت جس طرف ہوں اس طرف کے سلام میں ان کی بھی نیت کرے میت کے سلام کی نیت کرنے میں اختلاف ہے اور دونوں قول صحیح ہیں لیکن نیت میں میت کو شامل کرنے کے قول کو ترجیع معلوم ہوتی ہے\n" ));



                data.add(new data_model_arabicandurdu("","","چار تکبیریں اور سلام امام جہر کے ساتھ کہے اور دوسرا سلام پہلے سے کچھ آہستہ ہو اور مقتدی سب کچھ آہستہ کہیں امام اور مقتدی صرف پہلی تکبیر کے وقت ہاتھ اٹھائیں پھر ہاتھ نہ اٹھائیں، نمازِ جنازہ میں نہ قرائت قرآن ہے اور نہ رکوع و سجود و تشہد ہے\n"));
                return data;

            case "MJ":


                return data;


            case "Roza":

                data.add(new data_model_arabicandurdu("", "ye blank hoga", "روزے کے متعلق ضروری اور اہم مسائل و احکامات\n" +
                        "\n" +
                        "شرائط و جوب\n"));
                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\n" +
                        "روزہ جن شرائط کے ساتھ فرض ہوتا ہے وہ یہ ہیں:\n" +
                        "\n" +
                        "    مسلمان ہونا\n" +
                        "    عاقل ہونا\n" ));
                data.add(new data_model_arabicandurdu("","", "    بالغ ہونا\n" +
                        "    تندرست ہونا\n" +
                        "    مقیم ہونا\n" +
                        "    عورت کا حیض و نفاس سے پاک ہونا\n"));
                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\n" +
                        "دوسرے لفظوں میں کافر‘ پاگل یا مجنون‘ بچے‘ بیمار‘ مسافر اور حائضہ پر روزہ فرض نہیں‘ تاآنکہ پاگل عقل مند‘ بچہ بالغ‘ بیمار صحتمند‘ مسافر مقیم اور حائضہ حالت پاکیزگی میں آ جائے۔\n"));
                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\n" +
                        "شرائطِ وجوبِ ادا\n" +
                        "\n" +
                        "متذکرہ بالا صورتوں میں تین وجوہات ایسی ہیں جن کے رفع ہونے پر روزے کی قضا رمضان کے بعد واجب ہو گی۔ عدمِ ادائیگی کیصورت میں ساری زندگی اس پر روزہ واجب رہے گا۔\n" +
                        "\n"
                        ));
                data.add(new data_model_arabicandurdu("","","    بیمار جب مکمل طور پر تندرست ہو جائے اور روزہ رکھنے کی استطاعت کا مالک ہو جائے۔\n" +
                        "    مسافر جب سفر سے واپس آ جائے یا سفر کے بعد مقیم ہو جائے۔\n" +
                        "    عورت جب حیض و نفاس سے حالت طہر میں آ جائے۔\n"));
                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\n" +
                        "روزہ نہ رکھنے کے شرعی عذر\n" +
                        "\n" +
                        "جب مجبوریوں کے باعث شریعت نے رخصت دی ہے کہ اگر وہ چاہے تو روزہ رکھے‘ ورنہ مجبوری کے اختتام پر قضا روزوں کو اداکرے۔ عام طور پر واقع ہونے والے وہ بڑے بڑے عذر یہ ہیں:\n"));
                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\n" +
                        "1۔ مرض یا بھوک و پیاس کی شدت\n" +
                        "\n" +
                        "کوئی شخص کسی ایسے مرض میں مبتلا ہو جائے کہ روزہ رکھنے سے مرض کے بڑھ جانے کا خطرہ ہو یا پھر بھوک پیا س کی وجہ سے جانجانے کا خطرہ ہو۔ ان صورتوں میں دیندار اور مسلمان ڈاکٹر کی رائے ہی زیادہ قابل ِ اعتبار ہو گی۔\n" +
                        "\n"
                       ));

              data.add(new data_model_arabicandurdu("","", "2۔ سفر\n" +
                      "\n" +
                      "اس عذر کے لئے سفر کی مقدار وہی معتبر ہو گی‘ جس میں نماز کی قضا لازم آتی ہے۔ دورانِ سفر اگر روزہ باعث تکلیف نہ بنے توروزہ رکھ لینا ہی افضل ہے"));
                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\n" +
                        "3۔ کمزور‘ لاغر اور بوڑھا ہونا\n" +
                        "\n" +
                        "کوئی شخص کسی وجہ سے اتنا کمزور یا بڑھاپے کی وجہ سے بہت زیادہ لاغر ہو اور اسے دوبارہ طاقت آنے کی امید بھی نہ ہو تو اس کےلئے رخصت ہے کہ وہ ہر روزے کے بدلے صدقہ فطر کی مقدار میں فدیہ دیتا رہے یا کسی فقیر مسکین وغیرہ کو پیٹ بھر کر دو وقت کاکھانا کھلاتا رہے۔ معذور کو اس صورت میں یہ اختیار ہے کہ وہ یہ فدیہ شروع رمضان میں دے دے‘ ہر روز دیتا رہے یا آخر میں اکٹھاادا کر دے۔\n" +
                        "\n"
                        ));

                data.add(new data_model_arabicandurdu("","","4۔ عورت کا حاملہ ہونا یا دودھ پلانا\n" +
                        "\n" +
                        "رمضان المبارک میں کوئی عورت اگر حاملہ ہو یا بچے کو دودھ پلاتی ہو اور روزہ رکھنے سے اسے یا بچے کو نقصان پہنچنے کا خدشہ ہو تو وہبھی روزہ قضا کر سکتی ہے۔\n"));
                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\n" +
                        "5۔ جہاد میں شرکت\n" +
                        "\n" ));



             data.add(new data_model_arabicandurdu("","", "دشمن کے مقابلے میں لڑنا پڑے اور لڑائی میں حالت روزہ‘ کمزورہ کی وجہ سے کسی رکاوٹ کا سبب بنے تو ایسے مجاہد کے لئے بھیرخصت ہے۔\n" +
                     "\n" +
                     "ان تمام صورتوں میں معذور عورت یا مرد کو چاہئے کہ وہ سرعام کھانے پینے سے پرہیز کریں ‘کیونکہ اس سے رمضان المبارک کا تقدسپامال ہوتا۔"));

                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\n" +
                        "روزے کے ارکان\n" +
                        "\n" +
                        "روزے کی شرعی اور اصطلاحی تعریف سے ہی اس کے ارکان کا تعین ہو جاتا ہے یعنی:\n" +
                        "\n" ));


                data.add(new data_model_arabicandurdu("","", "    نیت ِ روزہ\n" +
                        "    امساک یعنی کھانے پینے سے پرہیز کرنا اور مباشرت سے رکے رہنا\n" +
                        "    سحری سے غروبِ آفتاب تک کے معین وقت کی پابندی\n"));
                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\n" +
                        "روزے کی نیت کے احکام\n" +
                        "\n" +
                        "نیت دل کے ارادے کا نام ہے۔ روزے کی صحت کے لئے نیت سب سے اولیت رکھتی ہے‘ ورنہ کھانے پینے سے محض رکےرہنے سے ہرگز روزہ نہیں ہو گا۔\n" +
                        "\n"
                      ));


                data.add(new data_model_arabicandurdu("","",  "کتبِ فقہ میں روزوں کی مختلف اقسام بیان ہوئی ہیں‘ جو حسب ذیل ہیں:\n" +
                        "\n" +
                        "    رمضان کا روزہ\n" +
                        "    نذر معین کا روزہ\n" +
                        "    نفلی روزہ\n"));

                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\n" +
                        "ان کی نیت رات سے کر لیں تو افضل ہے‘ ورنہ نصف النہار سے قبل نیت کر لینا بھی درست ہو گا‘ لیکن ان اقسام کے روزوںکے علاوہ نیت کا صبح صادق سے پہلے کرنا ضروری ہے‘ مثلاً کفارہ کے روزے‘ قضا کے روزے اور نذر غیر معین کے روزے۔\n" +
                        "\n"
                        ));
                data.add(new data_model_arabicandurdu("","","    اگر نیت کے مسنون الفاظ دہرا لئے جائیں تو افضل ہے ورنہ اگر کوئی سحر کے وقت روزہ رکھنے کے لئے اٹھا اور کچھ کھا پی کرروزہ رکھ لیا تو یہی اس کی نیت ہے۔\n" ));
                        data.add(new data_model_arabicandurdu("","",      "    جمہور ائمہ کے نزدیک ہر روزے کی الگ نیت ضروری ہے۔ البتہ امام ابو حنیفہ رضی اللہ عنہ کے نزدیک پورے رمضانالمبارک میں پہلے روزے کو نیت کر لینا ہی کافی ہے بشرطیکہ پورے ماہ میں روزوں کا تسلسل قائم رہے۔\n"
                      ));


             data.add(new data_model_arabicandurdu("","",  "    روزہ کی حالت میں محض روزہ توڑنے کی نیت سے روزہ نہیں ٹوٹتا ‘جب تک کہ کچھ کھایا پیا نہ جائے۔\n" +
                     "    اگر کوئی شخص رات کو روزہ کی نیت کر کے بعد میں اس نیت سے رجوع بھی کر لے اور اگلے دن صبح سے شام تک کھائےپیئے بغیر رہا تو یہ اس کا روزہ نہیں ہے۔\n"));

                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\n" +
                        "نیت دل کے ارادے کا نام ہے زبان سے دہرانے کیلئے مختصر الفاظ یہ ہیں:\n" +
                        "\n" +
                        "وبصوم غد  نویت من شهر رمضان.\n" +
                        "\n" +
                        "میں ماہِ رمضان کے کل کے روزے کی نیت کرتا ہوں۔\n"));
                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\n" +
                        "سحری و افطاری کے احکام\n" +
                        "\n" +
                        "    سحری کرنا یعنی صبح صادق سے قبل کچھ کھا پی لینا سنت ہے۔\n"

                        ));


                data.add(new data_model_arabicandurdu("","", "    سحری کا وقت تو نصف شب کے بعد شروع ہو جاتا ہے مگر افضل ترین سحری آخری حصہ شب کی ہے۔\n" +
                        "    سحری میں تاخیر افضل ہے تو افطاری میں جلدی کرنا سنت ہے:\n"));

                data.add(new data_model_arabicandurdu("","","    افطاری میں بلاوجہ تاخیر کرنا مکروہ ہے۔\n" +
                        "    افطاری میں عجلت سے مراد یہ نہیں کہ وقت سے پہلے ہی افطار کر لیا جائے اس پر احادیث میں سخت سزا کا ذکر آیا ہے۔\n" +
                        "    روزہ کھجور‘ چھوہارے یا پانی سے افطار کرنا سنت ہے اور مستحب یہ ہے کہ تین‘ پانچ یا نو دانے کھائے۔\n"));






                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\n" +
                        "روزہ توڑنے والی چیزیں\n" +
                        "\n" +
                        "    عمداً کھانے پینے یا جماع کرنے سے روزہ ٹوٹ جاتا ہے‘ اگر بھول کر کھا پی لیا‘ جماع کر لیا تو روزہ نہیں ٹوٹتا۔\n"
                        ));

                data.add(new data_model_arabicandurdu("","","    ہر قسم کی تمباکو نوشی سے روزہ ٹوٹ جاتا ہے۔\n" +
                        "    دانتوں میں رکی ہوئی چنے کے برابر یا اس سے کم چیز نکال کر کھا لی تو بھی روزہ جاتا رہا۔\n"
                       ));


         data.add(new data_model_arabicandurdu("","", "    نتھنوں میں دوا چڑھائی یا کان میں تیل ڈالا یا دوائی‘ تیل وغیرہ حلق میں چلا گیا تو روزہ ٹوٹ گیا‘ لیکن سادہ پانی اگر کان میں چلاگیا‘ اس سے کلی وغیرہ چاہے جتنی کثرت سے کر لیں‘ بشرطیکہ حلق کے اندر نہ جائے روزہ نہیں ٹوٹتا۔\n" +
                 "    بلاقصد بھی اگر کلی کرتے ہوئے پانی حلق سے نیچے چلا گیا تو روزہ نہ رہا۔\n"
         ));

                data.add(new data_model_arabicandurdu("","","    قصداً منہ بھر کر قے کی تو روزہ ٹوٹ گیا‘ بلااختیار اور بلا قصد قے ہو گئی تو (ا) اگر منہ بھر کر ہوئی اور کوئی قطرہ واپس حلقسے اتر گیا تو روزہ ٹوٹ جائے گا (ب) اگر منہ بھر کر نہیں ہوئی اور اس کے چند قطرے واپس چلے گئے تو روزہ نہیں ٹوٹےگا۔\n" +
                        "    خون تھوک کے ساتھ پیٹ میں چلا گیا اور خون تھوک پر غالب تھا تو روزہ ٹوٹ گیا‘ ورنہ نہیں۔\n" +
                        "    کنکری‘ لوہے کا ٹکڑا یا کسی ایسی چیز کا کھا لینا جو عام طور پر نہیں کھائی جاتی تو بھی روزہ ٹوٹ گیا۔\n" ));



              data.add(new data_model_arabicandurdu("","","    منہ میں کوئی ایسی رنگین چیز رکھی جس سے تھوک پر اس چیز کا رنگ غالب آ گیا اور وہ تھوک اس نے نگل لی تو روزہ جاتارہا۔\n" +
                      "    ماہ رمضان میں اگر اتفاق سے کسی کا روزہ ٹوٹ گیا تو روزہ ٹوٹنے کے بعد بھی کچھ کھائے پیئے نہیں ‘بلکہ سارا دن روزہ داروںکی طرح رہنا ضروری ہے۔\n"));


                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\n" +
                        "روزہ کے مکروہات\n" +
                        "\n" +
                        "مندرجہ ذیل امور روزہ کے مکروہات ہیں:\n" +
                        "\n" ));


                data.add(new data_model_arabicandurdu("","", "    جھوٹ‘ غیبت‘ چغلی‘ گالی گلوچ کرنا یا کسی کو تکلیف دینا۔\n" +
                        "    روزہ دار کا کوئی چیز بلاوجہ زبان پر رکھ کر چبانا یا چبا کر اگل دینا وغیرہ۔\n" +
                        "    قولاً یا عملاً جنسی رغبت اور شہوانی جذبات برانگیختہ کرنے والے امور۔\n" ));


                                data.add(new data_model_arabicandurdu("","","    روزہ کی حالت میں پانی چڑھانے یا کلی کرنے میں مبالغہ کرنا۔\n" +
                                        "    پیاس کی حالت میں پانی کے غرغرے کرنا ‘کیونکہ اس صورت سے روزہ ضائع ہونے کا قوی امکان ہے۔\n"));


                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\n" +
                        "علاوہ ازیں غسل کرنا‘ ٹھنڈا پانی سر پر ڈالنا‘ کلی کرنا‘ سادہ مسواک کرنا‘ سرمہ لگانا‘ بدن پر تیل ملنا‘ خوشبو لگانا یا سونگھنا مکروہاتروزہ میں شمار نہیں ہوتے۔\n"));
                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\n" +
                        "روزہ توڑ ڈالنے کا کفارہ\n" +
                        "کسی شرعی عذر کی وجہ سے رمضان کا روزہ یا کوئی دوسرا نفلی روزہ ٹوٹ گیا تو اس کی قضا لازم ہے‘" ));
                data.add(new data_model_arabicandurdu("", "ye blank hoga",       " لیکن بلا عذر شرعی رمضانالمبارک کا روزہ توڑنے پر قضا کے ساتھ کفارہ ادا کرنا بھی ضروری ہے۔ رمضان المبارک کے ایک روزے کا بدل تو سال بھر کےروزے بھی نہیں بن سکتے‘ " ));
                        data.add(new data_model_arabicandurdu("", "ye blank hoga",      " لیکن شریعت نے اس کی کم از کم مقدار یہ مقرر کی ہے کہ وہ شخص لگاتار دو ماہ یعنی ساٹھ ایام کےروزے رکھے۔ " ));
                                data.add(new data_model_arabicandurdu("", "ye blank hoga",      "اس میں تسلسل شرط ہے یا پھر اس کی طاقت نہ رکھتا ہو تو ساٹھ مساکین کو دونوں وقت کا کھانا پیٹ بھر کرکھلائے"));


                return data;


            case "Umrah":

                data.add(new data_model_arabicandurdu("", "ye blank hoga", "فقہی مسایل اور قیودات کی وضاحت کے بغیر یہاں عوام کے لیئے مناسب آسان طورپر عمرہ اور حج کا طریقہ لکھاجاتاہے۔ اس میںجو باتیں جہاں جس" +
                        " طرح کرنی لکھی گئ ہیں، ضروری نہیں ہے کہ اسی طرح کرنا ضروری ہو، بلکہ آسان طریقہ لکھاگیاہے،"
                ));

                data.add(new data_model_arabicandurdu("", "ye blank hoga",  " مثلا احرامکے بارے میں لکھاہے کہ اپنے مقامی ایر پورٹ سے باندھ لیں، یہ اس لیے عام طورپر ہوائی جہاز کے سفر کے درمیان میقاتآجاتی ہے اور اس وقت احرام باندھنا دشوار ہوتاہے"));

                        data.add(new data_model_arabicandurdu("", "ye blank hoga", "عمرہ کااحرام\n" +
                        "\n" +
                        "اپنےمقامی ائیرپورٹ سےعمرہ کا احرام باندھ کر دو رکعت نماز پڑھ کرسلام پھیر کر قبلہ رو بیٹھ کر سر کھول کر اسی جگہ درج ذیل طریقہپر نیت کریں \n"));
                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\n" +
                        "اَللّٰھُمَّ اِنِّی اُرِیدُ العُمرَۃَ فَیَسِّرھَا لِی وَ تَقَبَّلھَا مِنِّی\n"));
                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\n" +
                        "نیت کےبعد مرد بلند آواز سےاور عورت پست آواز سےنیچےکا تلبیہ پڑھے:\n"));
                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\n" +
                        "لَبیکَ اَللّٰھُمَّ لبّیک لبَّیک لا شَرِیکَ لَکَ لبَّّیک، اِنَّ الحَمدَ وَ النِّعمۃ لَکَ وَ المُلکَ، لا شَرِیکَ لَکَ\n"));
                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\n" +
                        "نیت کرکےتلبیہ کہنےکےساتھ ہی آپ کا احرام شروع ہو گیا، عمرہ کےسلسلہ کا پہلا عمل یہی احرام ہے، اب مکہ معظمہ پہونچنےتکآپ کو کوئی خاص کام کرنا نہیں ہے۔ بس احرام کی پابندیوں سےبچتےرہو۔\n"));
                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\n" +
                        "مسجد حرام میں داخلہ :\n" +
                        "\n" +

                        "\n" ));
                data.add(new data_model_arabicandurdu("","","مکہ مکرمہ میں اپنےمقام پر اسباب وغیرہ کا بند و بست کرکےسب سےپہلےمسجد حرام میں حاضر ہونا چاہیے۔تلبیہ پڑھتےہوئےنہایتخشوع و خضوع کےساتھ دربار الہی کی عظمت و جلال کا لحاظ کرتےہوئےمسجدحرام میں دعا پڑھ کر داخل ہوں۔" ));

                        data.add(new data_model_arabicandurdu("","",  " اب نظریںجھکائےھوئےآگےبڑھیے، کیونکہ آپکو کعبۃ اللہ تک جانا ہے، ایک اندازہ کےمطابق تقریبا دو سو قدم چلنےکےبعد آپ برآمدوں سےگزرکرحرم شریف کےصحن میں آجائیں گے۔ " ));

                data.add(new data_model_arabicandurdu("","",       "اور جب نظر اٹھائیں گےتو آپکی نظر سیدھی کعبۃ اللہ پر پڑےگی، کعبۃ اللہ پر پڑنےوالی یہ آپکیپہلی نظر ہوگی جو دعا کی قبولیت کی گھڑی ہے،" ));
                        data.add(new data_model_arabicandurdu("", "ye blank hoga",   " لہذا اپنی نظریں وہیں جما دیجئے ۔اور پھر جی بھر کر بصد آداب و شکر اپنی خوش قسمتیپر نازاں، نہایت عجز و نیاز سےدین و دنیا کی ساری جائز اور نیک خواہشات کی دعا کیجیئے، " ));

                data.add(new data_model_arabicandurdu("","",      "اگر آپ پریشان ہیں کہ کونسی دعا کریں تواپنی تمام تر دعاؤں کو ذہن و نیت میں رکھ کر سورۂ فاتحہ بسم اللہ تا آمین پڑھ لیجئیے " ));
                        data.add(new data_model_arabicandurdu("", "ye blank hoga",  "کیونکہ یہ ام الکتاب بھی ہے اور افضل الدعا بھی،سب سےاہم دعا یہ کرنی چاہیےکہ اللہ تعالی بغیر حساب و کتاب جنت میں داخلہ عنایت فرمائیں۔"));



                data.add(new data_model_arabicandurdu("","","اپنےمقامی ایرپورٹ سےچونکہ آپ نےعمرہ کا احرام باندھا ہے، اور عمرہ میں کل تین کام کرنےہوتےہیں۔\n"));

                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\n" +
                        "(١) طواف کرنا (جو رکن اور فرض ہے) \n" +
                        "\n" +
                        "(٢)عمرہ کی سعی کرنا (جو واجب ہے) \n" +
                        "\n" +
                        "(٣) بال کٹوانا یا منڈوانا (یہ بھی واجب ہے)۔\n"));





                        data.add(new data_model_arabicandurdu("", "ye blank hoga",      "طواف : طواف کےمعنی بیت اللہ کےچاروں طرف ایک خاص طریقےسےسات چکر یعنی سات مرتبہ گھومنا ہے۔طواف کی ابتداءحجرِ اسود سےہوتی ہے، " ));

                                data.add(new data_model_arabicandurdu("", "ye blank hoga",        "اس لئےکعبۃ اللہ کےجس کونہ میں حجر اسود لگا ہو ا ہے، حکومت سعودیہ نےاس جانب کالے پتھر کی ایکلمبی لکیر بنادی ہے،" ));
                                        data.add(new data_model_arabicandurdu("", "ye blank hoga",   " اس طرف پہونچنے کی کوشش کریں۔لکیر کےقریب پہونچ جائیں تو لکیر سےآدھا فٹ قبل بائیں طرف بیت اللہ کیجانب منھ کرکےکھڑے ھو جائیں،" ));

                                        data.add(new data_model_arabicandurdu("", "ye blank hoga",      " اسکے بعد اضطباع کریں یعنی داہنےکندھےکےنیچےسےچادر نکال کر بائیں کندھے پر ڈال دیں، اسکےبعد طواف کی نیت کریں،" ));
                                                data.add(new data_model_arabicandurdu("", "ye blank hoga", " اور یہ بات یاد رکھیں کہ طواف میں نیت فرض ہے، نیت دل کے ارادے کا نام ہے بغیر نیتکےطواف ادا نہیں ہوگا۔ نیت کے زبانی الفاظ یہ ہیں :"));
                data.add(new data_model_arabicandurdu("", "ye blank hoga",
                        "اَللّٰھُمَّ اِنِّی اُرِیدُ طَوَافَ بَیتِکَ الحَرَامِ، سَبعۃ اَشوَاطٍ لِلّٰہِ تَعَالٰی، فَیَسِّرہ لِی، وَ تَقَبَّلہ مِنِّی۔\n"));
                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\n" +
                        "اب د ا ہنی طرف اتنا ہٹو کہ آپکےپاوں سیاہ لکیر پر آجائیں اور حجر اسود ٹھیک آپکےسامنےھو جائےاسکےبعد یہ دعا پڑھو : بِسمِ اللّٰہِ،اللّٰہُ اکبَر، وَ لِلّٰہِ الحَمد\n" ));


                        data.add(new data_model_arabicandurdu("", "ye blank hoga",   "مذکورہ دعا کےساتھ اپنےدونوں ہاتھ اس طرح اٹھائیں جس طرح نماز میں کانوں تک اٹھا ہیں پھر چھوڑ دیں" ));
                                data.add(new data_model_arabicandurdu("", "ye blank hoga",    " اور حجر اسود کو استلام یابوسہ دیکر دا ہنی طرف گھوم کر طواف شروع کریں، مرد پہلےتین چکروں میں رمل کرے یعنی جھپٹ کر تیزی کےساتھ چلے،" ));

                                data.add(new data_model_arabicandurdu("", "ye blank hoga",    " زورسےقدم اٹھائے۔ قدم نزدیک نزدیک رکھتےہوئےموندھوں کو پہلوانوں کی طرح خوب ہلاتا ہوا چلے۔ اور مابقیہ چار چکر اپنی اصلی رفتارسے پورےکریں۔ آپکو بیت اللہ کےگرد گھوم کر سات چکر پورے کرنےہیں،" ));

                                        data.add(new data_model_arabicandurdu("", "ye blank hoga",    " ہر چکر حجر اسود والےکونےسےشروع ھوگا اور وہیںآکر پورا ہوگا، ہر چکر پورا ھونےپر آپکو بِسمِ اللّٰہِ، اللّٰہُ اکبَر، وَ لِلّٰہِ الحَمدُ پڑھ کر حجر اسود کو بوسہ " ));

                                                data.add(new data_model_arabicandurdu("", "ye blank hoga",    "یا استلام کرکے نیا چکر شروع کرنا ہےاورجب جب رکن یمانی پر پہونچیں تو اس کو دونوں ہاتھ یا صرف دائیں ہاتھ سےچھو لینا سنت ہے،" ));
                                                        data.add(new data_model_arabicandurdu("", "ye blank hoga",    "اس کو بوسہ دینا خلاف سنت ہے،ہاں مگر اس بات کا خیال رکھیں کہ سینہ بیت اللہ کی طرف مڑنےنہ پائے،" ));

                                                        data.add(new data_model_arabicandurdu("", "ye blank hoga",      " اگر رکن یمانی پر ہاتھ لگانےکا موقع نہ ملےتو بغیر ہاتھلگائےگذر جائیں ۔ اسطرح جب سات چکر پورےکرکےساتویں چکر کےاختتام پر حجر اسود کو بوسہ دینگےتو یہ اس طواف کا آٹھواںبوسہ ھوگا،" ));

                                                                data.add(new data_model_arabicandurdu("", "ye blank hoga",    " ایک بوسہ وہ جو طواف شروع کرتےوقت لیا تھا اور سات بوسے، سات چکروں کے۔ اسطرح مجموعی آٹھ بوسےہونگے۔"));
                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\n" +
                        "دوران طواف کوئی مخصوص دعا پڑھنا ضروری نہیں ہے، اگر دعائیں یاد نہ ھوں تو اپنی مادری زبان میں اللہ تعالی سےجو مانگنا چاہیںمانگتےرہیں، اگر کچھ بھی پڑھےبغیر" +
                        "، خاموشی کےساتھ بیت اللہ کےگرد سات چکر لگاوگےتو بھی آپکا طواف ھوجائیگا۔مگر اچھا یہ ہے کہکلمہ طیبہ ودرود کا ورد لا الہ الا اللہ محمد رسول اللہ صلی اللہ علیہ وسلم جاری رکھیں مزید  ذیل میں دی گئی دو دعائیں بھی یاد فرمالیں۔ \n"));
                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\n" +
                        "(١) سُبحَانَ اللّٰہِ، وَ الحَمدُ لِلّٰہِ، وَ لا اِلٰہَ اِلاّ اللّٰہُ، وَ اللّٰہُ اَکبَر، وَ لا حَو´لَ وَ لا قُوَّۃ اِلاّ بِاللّٰہِ العَلِیِّ العَظِیمِ۔\n" +
                        "\n" +
                        "(٢) رَبَّنَا اٰتِنَا فِی الدُّنیَا حَسَنَہً وَ فِی الآخِرَۃ حَسَنَۃ وَ قِنَا عَذَابَ النَّار\n"));
                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\n" +
                        "ساتوں چکروں میں حجر اسود سےرکن یمانی کےدرمیان پہلےنمبر کی دعا اور رکن یمانی سےحجر اسود کےدرمیان دوسرےنمبر کی دعا پڑھیں۔\n" +
                        "\n"
                       ));

                data.add(new data_model_arabicandurdu("","", "دوگانہ طواف : طواف کےکےبعد طواف کی دو رکعت نماز مقام ابراھیم کےپیچھےیا اس کےآس پاس جہاںبھی جگہ مل جائےکندھادھانک کر پڑھ لیں۔نماز " ));
                        data.add(new data_model_arabicandurdu("", "ye blank hoga",  "اور دعا سےفارغ ہو کر اگر ممکن ہو تو مُلتَزَم پر جائیں اگر ملتزم سےچمٹنےکا موقع نہ مل سکےتو حرم میں کہیںسےبھی ملتزم کی جانب منھ کرکےاسپر نظریں جما کر دعا کرلیجئے۔"));

                data.add(new data_model_arabicandurdu("","", "زمزم کا پانی پینا : دعا کر کےزم زم شریف پر آئیےاور قبلہ رو ہو کر بسم اللہ پڑھ کےتین سانس میں خوب ڈٹ کر آبِ زم زم پیجئے،زم زم پی کر الحمد للہ کہہ کر یہ دعا پڑھیں۔\n"));

                data.add(new data_model_arabicandurdu("", "ye blank hoga",
                        "اَللّٰھُمَّ اِنِّی اَسئَلُکَ عِلمًا نَافِعًا، وَ رِزقًا وَاسِعًا، وَ شِفَاعًا مِن´ کُلِّ داء\n"));
                data.add(new data_model_arabicandurdu("", "ye blank hoga",
                        "صفامروہ کےدرمیان سعی : صفا اور مروہ کےدرمیان مخصوص طریقہ پر سات چکر لگانےکوسعی کہتےہیں، حج اور عمرہ کرنےوالےپر سعیکرنا واجب ہی۔جس طرح طواف حجر اسود کےاستلام سےشروع ہوتا ہے" ));
                                data.add(new data_model_arabicandurdu("", "ye blank hoga",  "اسی طرح سعی بھی حجر اسود کےاستلام سےشروع کرناآپ کی سنت ہے۔ اسلئےحجر اسود کا استلام کر لیں یا دور سےاسکی جانب ہتھیلیاں اٹھا کرہتھیلیوں کو چوم کر باب الصفا کی جانببڑھیں۔"));



             data.add(new data_model_arabicandurdu("","", "حجر اسود کی نشانی والی کالی پٹی کی سیدھ میں چلیں، اسی جانب صفا پہاڑی کا مقام ہےاور وہاں عربی و انگلش میں ”الصفا “کا بورڈ لگاہوا ہے۔ وہاںسےٹھورا آگےبڑھنے کے بعد پہاڑ کی علامت شروع ہو جاتی ہے۔اب دل میں سعی کی نیت کریں اور ممکن ہو تو زبانسےاِس طرح پڑھیں :\n"));



                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\n" +
                        "اَللّٰھُمَّ اِنِّی اُرِیدُ السَّعیَ بَینَ الصَّفَا وَ المَروۃَ سَبعۃ اَشوَاطٍ لِوَجھِکَ الکَرِیمِ ، فَیَسِّرہ لِی وَ تَقَبَّلہُ مِنِّی۔\n"));
                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\n" +
                        "پھر دونوں ہاتھ اس طرح اٹھائیں جیسےدعا میں اٹھائےجاتےہیں۔ اور خوب دعائیں مانگیں، تقریبا پچیس اٰیات پڑھنےکی مقدارکھڑےرہکر اپنی رفتار سےذکر کرتےہوئی، دعا مانگتےھوئےمروہ پہاڑی کی طرف چلیں۔ صفا مروہ کےبیچ بھی دل کی گہرائیوں سےدعائیںمانگیں اگر کچھ نہ بن پڑے تو فقط کلمہ طیبہ و درود سلام لا الہ الا اللہ محمد رسول اللہ صلی اللہ علیہ وسلم مسلسل پڑھتے رہیں کہ یہ تماماذکار سے افضل اور آسان ہے۔\n" +
                        "\n"
                        ));


               data.add(new data_model_arabicandurdu("","","صفا مروہ کےدرمیان جب وہ جگہ آنےلگےجہاں چھت میں سبز رنگ کی روشنیاں لگائی ہوئی ہیں اور وہ جب بقدر چھ ہاتھ کےدوریپرہو تو درمیانی چال سےدوڑنا شروع کریں اور دوسرے سبز لائٹوں کےبعد بھی چھ ہاتھ تک دوڑیں،" ));
                data.add(new data_model_arabicandurdu("","",   " پھر اپنی چال چلنےلگیں۔ آگےمروہپہاڑی آئیگی ، اسپر چڑھیں اور بیت اللہ کی جانب رخ کرکےکھڑےھو کر جسطرح صفا پہاڑی پر ذکر و شکر اور دعائیں کی تھیں اسیطرح یہاں بھی کریں، اب آپکا ایک چکر مکمل ہوگیا، اسکےبعد مروہ سےصفا یہ آپکا دوسرا چکر ختم ھوا،" ));
                        data.add(new data_model_arabicandurdu("","",    " بس اسی طرح آپکو سات چکرمکمل کرنےہیں۔ ساتواں چکر مروہ پہاڑی پر ختم ہوگا۔ اب آپ مطاف میں آکر کسی بھی جگہ دو رکعت نماز پڑھیں ، شرط یہ ہےکہمکروہ وقت نہ ہو۔"));



                data.add(new data_model_arabicandurdu("", "ye blank hoga", "\n" +
                        "سر کا حلق : عمرہ کےتمام اعمال پورے ہو گئےاس لئےمسجد سےباہر نکل کر سر کا حلق یا قصر کروالیں،اب آپ کا عمرہ پورا ہو گیا اورآپکا احرام بھی ختم ہو گیا۔ اب احرام کی کوئی پابندی آپ پر نہیں رہی،\n"));


                return data;

            case "Zakat":

                data.add(new data_model_arabicandurdu("", "", "زکوٰۃ کے فضائل و مسائل\n"));
                        data.add(new data_model_arabicandurdu("", "" ,      "دین اسلام میں زکوٰۃ ہر مالدار صاحبِ نصاب پر فرض ہے۔زکوٰۃ کی معاشرتی حیثیت  ایک مکمل اور جامع نظام  کی ہے ۔ اگر ہر صاحبِ نصاب زکوٰۃ دینا شروع کر دے تو مسلمان معاشی طور پر خوشحال ہو سکتے ہیں" ));
                                data.add(new data_model_arabicandurdu("", "" ,       " اور اس قابل ہو سکتے ہیں کہ کسی غیر سے قرض کی بھیک نہ مانگیں اورزکوٰۃ ادا کرنے کی وجہ سے بحیثیت مجموعی مسلمان سود کی لعنت سے بچ سکتے ہیں۔" ));
                data.add(new data_model_arabicandurdu("", "",
                        "زکوۃ کی فضیلت:" + "قرآن کریم میں اللہ تعالیٰ نے تقریباً 32 مقامات پر نماز کے ساتھ زکوٰۃ کو ذکر فرمایا ہے" ));

                        data.add(new data_model_arabicandurdu("", "",   "۔ جس سے اس کی اہمیت معلوم ہو سکتی ہے ۔ اور نبی پاک صلی اللہ علیہ وسلم کی کئی بے شمار احادیث میں زکوٰۃ کی فضیلت ، ترغیب اور افادیت کو اجاگر کیا گیا ہے " ));

                                data.add(new data_model_arabicandurdu("", "",  "۔ معلوم یہ ہوا کہ زکوٰۃ کو دین میں بہت اہمیت دی گئی ہے ۔اور زکوٰۃ ادا نہ کرنے والے کو سخت عذاب کی وعید بتلائی گئی ہے ۔ ایک حدیث ملاحظہ ہو !"));



                                data.add(new data_model_arabicandurdu("","", "عن ابن مسعود رضی اللہ عنہ عن النبی صلی اللہ علیہ وسلم قال: ما من رجل لا یؤدی زکوۃ مالہ الا جعلہ اللہ یوم القیامۃ فی عنقہ شجاعا ۔۔۔ ولا یحسبن الذین یبخلون بما آتاہم اللہ من فضلہ ۔) جامع الترمذی (\n" ));
                                        data.add(new data_model_arabicandurdu("", "",   "ترجمہ: حضرت عبداللہ بن مسعود رضی اللہ عنہ آپ علیہ السلام کا ارشاد نقل فرماتے ہیں کہ  جو شخص اپنے مال کی زکوۃ ادا نہیں کرتا قیامت کے دن اس کا مال گنجے سانپ کی شکل میں اس کی گردن میں ڈال دیا جائے گا۔ )راوی" ));
                                                data.add(new data_model_arabicandurdu("", "",    " کہتے ہیں کہ پھر آپ صلی اللہ علیہ وسلم نے قرآن پاک کی آیت کا مصداق ہمیں سمجھایا اور یہ آیت تلاوت کی جس کا ترجمہ یہ ہے " ));
                                                        data.add(new data_model_arabicandurdu("", "",   "(اور ہرگز خیال  نہ کریں ایسے لوگ جو ایسی چیز میں بخل کرتے ہیں جو اللہ نے ان کو اپنے فضل سے دی ہے کہ یہ بات کچھ ان کے لیے اچھی ہوگی بلکہ " ));
                                                                data.add(new data_model_arabicandurdu("", "",     "یہ بات ان کی بہت بری ہے وہ لوگ قیامت کے روز طوق پہنادیے جائیں گے اس کا جس میں انہوں نے بخل کیا تھا"));


                data.add(new data_model_arabicandurdu("", "", "صاحبِ نصاب کون ہے ؟:\n" +
                        "جس مرد یا عورت کی ملکیت میں ساڑھے سات تولہ سونایا ساڑھے باون تولہ چاندی یا نقدی مال یا تجارت کا سامان یا ضرورت سے زائد سامان میں سے کوئی ایک چیز یا ان پانچوں چیزوں یا بعض کامجموعہ ساڑھے باون تولہ چاندی کی قیمت کے برابر ہو تو ایسے مردو عورت کو صاحب نصاب کہا جاتا ہے ۔"));
                data.add(new data_model_arabicandurdu("", "", "\n" +
                        "وجوب کی شرائط:\n" +
                        "1:     مسلمان ہونا\n" +
                        "2:     نصاب کا پورا ہونا\n" +
                        "3:     عاقل بالغ ہو\n" +
                        "4:     اس پر سال گزر جائے۔"));
                data.add(new data_model_arabicandurdu("", "", "زکوۃ  کے چند اہم مسائل"));
                data.add(new data_model_arabicandurdu("", "", "\n" +
                        "مسئلہ1: اگر کسی کی آمدنی کافی ہے لیکن وہ مقروض ہے اور خرچہ زیادہ ہونے کی وجہ سے قرض ادا کرنے پر قادر نہیں تو ایسے آدمی پر زکوٰۃ واجب نہیں۔\n" +
                        "مسئلہ2: جس شخص کی ماہانہ آمدنی معقول ہے لیکن سال بھر تک اس کے پاس نصاب کی مقدار جمع نہیں رہتی اور اس پر زکوۃ واجب نہیں ۔\n" ));


                                data.add(new data_model_arabicandurdu("","",  "مسئلہ3: اگر ادھار کی رقم نصاب کے برابر یا اس سے زیادہ ہے تو وصول ہونے کے بعد زکوۃ ادا کرنا لازم ہوگا اگر ادھار کی رقم وصول ہونے میں چند سال کا عرصہ گزر گیا تو گزشتہ تمام سالوں کی زکوۃ دینا لازم ہوگا۔\n" +
                                        "مسئلہ4: اگر استاد غریب ہے نصاب کا مالک نہیں تو شاگرد کے لیے استاد کو زکوۃ دینا جائز بلکہ مستحق استاد کو زکوۃ دینے کا ثواب زیادہ ملے گا "));


                data.add(new data_model_arabicandurdu("", "", "\n" +
                        "مسئلہ5: مردہ کے ایصال ثواب کے لیے زکوۃ کی رقم دینا جائز نہیں بلکہ دوسری حلال رقم صدقات زکوۃ کے علاوہ سے ایصال ثواب کرنا ہوگا ورنہ میت کو ثواب نہیں ہوگا۔\n" ));

                data.add(new data_model_arabicandurdu("","","مسئلہ6: باپ اور بیٹا مل کر پیسہ کماتے ہیں اور پیسہ والد کے قبضہ میں ہے اور  باپ ہی اس میں سے تصرف کرتا ہے اور وہ رقم نصاب کے برابر ہے تو سال گزرنے کے بعد باپ کے" ));
                        data.add(new data_model_arabicandurdu("","",  " لیے زکوۃ ادا کرنا لازم ہوگا بیتے کے لیے نہیں کیونکہ ان پیسوں کا مالک  باپ ہے ہاں اگر وہ اپنا اپنا پیسہ تقسیم  کردیں تو الگ الگ زکوۃ واجب ہوگی۔"));

//                data.add(new data_model_arabicandurdu("","",));


                data.add(new data_model_arabicandurdu("", "", "\n" +
                        "مسئلہ7: اپنے باپ کو زکوۃ دینا جائز نہیں۔\n"

                       ));


                                data.add(new data_model_arabicandurdu("","","مسئلہ8: بچہ اگر صاحب نصاب ہے تو نابالغ ہونے کی وجہ سے اس کے مال وغیرہ پر زکوۃ واجب نہیں اور ولی کے لیے نابالغ کے مال سے زکوۃ ادا کرنا لازم نہیں ہوگا دوسری عبادات کی طرح بچہ پر زکوۃ بھی واجب نہیں۔\n"));

                data.add(new data_model_arabicandurdu("","","مسئلہ9: زکوۃ کی رقم سے مکانات بناکر مستحق لوگوں میں تقسیم کرنے سے زکوۃ ادا ہوگی البتہ مستحق لوگوں کو مکمل طور پر مالک بنا دینا ضروری ہے " ));
                        data.add(new data_model_arabicandurdu("","",  "مکان کا قبضہ بھی دےدیں رجسٹرڈ کراکر کاغذات بھی ان کے حوالے کر دے  تاکہ وہ اپنے اختیار سے جس قسم کا جائز تصرف کرنا چاہے کرسکیں۔"));

                data.add(new data_model_arabicandurdu("","", "مسئلہ 10: جو رقم زکوٰۃ کی نیت کے بغیر اد اکی جائے اور جس کو دی جائے وہ خرچ بھی کرلے اب اگر اس مال کو زکوۃ میں شمار کیا جائے تو وہ درست نہیں اور زکوۃ ادا نہیں ہوگی"));

                        data.add(new data_model_arabicandurdu("", "", "مسئلہ11: بھابھی،  بھائی، بھتیجا، بہن اگر وہ نصاب کے مالک نہیں اور مستحق بھی ہیں  اور ان کا کھانا  پینا الگ ہو تو ان سب کو زکوۃ دینا جائز ہے۔\n" ));
                                data.add(new data_model_arabicandurdu("", "",    "مسئلہ12: اگر حکومت  یا بینک والے کھاتے داروں سے ان کی اجازت سے اصل رقم  سے زکوۃ کاٹ کر مستحقین زکوۃ کو مالکانہ طور پر دیتے ہیں تو زکوۃ ادا ہوگی اور" ));
                                        data.add(new data_model_arabicandurdu("", "",   " اگر اصل رقم سے ادا تو کریں لیکن مالک کے اجازت کے بغیر تو پھر زکوۃ ادا نہیں ہوگی مالک کو زکوۃ ادا کرنا ضروری ہے" ));
                                                data.add(new data_model_arabicandurdu("", "",   " اور اگر وہ حکومت  یا بینک والے اصل رقم سے نہیں بلکہ نفع کے نام پر جمع ہونے والی سود کی رقم سے زکوۃ ادا کریں تو زکوۃ بالکل ادا نہیں ہوگی کیونکہ حرام رقم سے زکوۃ ادا نہیں ہوتی"));
                data.add(new data_model_arabicandurdu("", "", "\n" +
                        "مسئلہ13: بیوی کو اگر شوہر زکوۃ دے تو یہ جائز نہیں۔\n" +
                        "مسئلہ 14: اگر بیوی صاحب نصاب ہے تو خود بیوی کو زکوۃ ادا کرنا ضروری ہے شوہر پر ضرور ی نہیں۔\n" ));


                                data.add(new data_model_arabicandurdu("","", "مسئلہ15: پرائز بانڈ کی اصل قیمت یعنی جس رقم سے پرائز بانڈ خریدا ہے  وہ نصاب  کے برابر ہو تو اس اصلی رقم پر زکوۃ واجب ہے" ));
                                        data.add(new data_model_arabicandurdu("","",     " اور ہر قرعہ اندازی میں نام نکلنے کی صورت میں جو رقم زائد ملتی ہے وہ نہ تو لینا جائز ہے اور نہ ہی اس پر زکوٰۃ ہے جہاں سے لیتا ہے واپس کرے ورنہ بغیر ثواب کی نیت کے صدقہ کردینا ضروری ہے۔\n" ));
                                                data.add(new data_model_arabicandurdu("","",     "مسئلہ 16: اگر کوئی تجارت کی نیت سے پلاٹ خریدے یا زمین خریدے )یعنی فروخت کرنے کی نیت سے( تو اس صورت میں اس کی قیمت سے ہر سال زکوۃ ادا کرنا فرض ہے اور ہر سال مارکیٹ میں جو فروخت کی قیمت ہوگی اس کا اعتبار ہوگا"));
//                data.add(new data_model_arabicandurdu("","",));



                data.add(new data_model_arabicandurdu("", "", "\n" +
                        "مثلاً ایک پلاٹ ایک لاکھ میں خریدا تھا سال مکمل ہونے پر اس کی قیمت 5لاکھ ہوگی تو زکوۃ 5لاکھ سے دینی ہوگی اور اگر پلاٹ ذاتی ضروریات کے لیے خریدا تو اس پر زکوۃ واجب نہیں، اور اگر پلاٹ خریدا رقم کو محفوظ کرنے کے لیے تو اس صورت میں بھی زکوۃ ہر سال واجب ہوگی۔\n"));

                                data.add(new data_model_arabicandurdu("","","مسئلہ 17: اگر پلاٹ خریدتے وقت فروخت کرنے کی نیت نہیں تھی بعد میں فروخت کرنے کا ارادہ ہوگیا تو جب تک اس کو فروخت نہیں کیا جائے اس پر زکوۃ واجب نہیں۔"));


                data.add(new data_model_arabicandurdu("", "", "\n" +
                        "مسئلہ 18: اگر کوئی شخص سال کے پورے ہونے سے پہلے یا سال مکمل ہونے کے بعد تھوڑی تھوڑی کر کے زکوۃ ادا کرے تب بھی جائز ہے۔\n" ));

                data.add(new data_model_arabicandurdu("","","مسئلہ 19: اگر کسی آدمی نے کمیٹی کے طور پر پیسے جمع کروائے ہوں اور وہ نصاب کے برابر بھی ہوں اور پھر اس آدمی پر کسی قسم کاقرض وغیرہ بھی نہ ہو تو" ));
                        data.add(new data_model_arabicandurdu("","",  " اس محفوظ شدہ پیسوں کی زکوۃ ادا کرنی ضروری ہوگی اور زکوۃ ادا کرتے وقت کمیٹی کی جمع شدہ رقم کو اصل مال اور نقدی کے ساتھ ملایا جائے گا۔"));


                data.add(new data_model_arabicandurdu("", "",  
                        "مسئلہ 20: اگر کوئی شخص یوں کرتا ہے کہ وہ انکم ٹیکس ادا کرتا ہے اور پھر یہ سمجھتا ہے کہ انکم ٹیکس کے ساتھ ساتھ زکوٰہ بھی ادا ہو گئی ۔ تو اس کی یہ سوچ غلط ہے کیونکہ انکم ٹیکس ملکی ضروریات کے لئے گورنمنٹ کی طرف سے مقرّر ہے،" ));
                        data.add(new data_model_arabicandurdu("",""," جبکہ زکوٰة ایک مسلمان کے لئے فریضہٴ خداوندی اور عبادت ہے، انکم ٹیکس ادا کرنے سے زکوٰة ادا نہیں ہوتی، بلکہ زکوٰة کا الگ ادا کرنا فرض ہے۔"
                       ));

                data.add(new data_model_arabicandurdu("","", "نوٹ : ہم نے چند مسائل لکھ دیے ہیں ۔ زکوٰۃ کے باقی مسائل دریافت کرنے کے لیے اپنے قریبی علماء / دارلافتاء سے رابطہ کریں"));

                return data;
            default:
                return data;


        }

    }

}